IDEA StatiCa Open Model
OpenModelClassAttribute Constructor (String, String, Type)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenModelClassAttribute(
	string structuralModelClassType,
	string structuralModelContainerType,
	Type openModelListType
)
Public Sub New (
	structuralModelClassType As String,
	structuralModelContainerType As String,
	openModelListType As Type
)
public:
OpenModelClassAttribute(
	String^ structuralModelClassType,
	String^ structuralModelContainerType,
	Type^ openModelListType
)
Parameters
structuralModelClassType
Type: System.String
Equivalent SM type
structuralModelContainerType
Type: System.String
SM container type
openModelListType
Type: System.Type
List type in Open Model
See Also
Reference
OpenModelClassAttribute Class
OpenModelClassAttribute Overload
IdeaRS.OpenModel Namespace